zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_PRIV.h
/*! @name IEICR0 - Integrity error injection config register 0 */
/*! @{ */

#define NETC_PRIV_IEICR0_LINK_SLICE_ID_MASK      (0x1FU)
#define NETC_PRIV_IEICR0_LINK_SLICE_ID_SHIFT     (0U)
#define NETC_PRIV_IEICR0_LINK_SLICE_ID_WIDTH     (5U)
#define NETC_PRIV_IEICR0_LINK_SLICE_ID(x)        (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_IEICR0_LINK_SLICE_ID_SHIFT)) & NETC_PRIV_IEICR0_LINK_SLICE_ID_MASK)

#define NETC_PRIV_IEICR0_BLOCK_ID_MASK           (0x1F00U)
#define NETC_PRIV_IEICR0_BLOCK_ID_SHIFT          (8U)
#define NETC_PRIV_IEICR0_BLOCK_ID_WIDTH          (5U)
#define NETC_PRIV_IEICR0_BLOCK_ID(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_IEICR0_BLOCK_ID_SHIFT)) & NETC_PRIV_IEICR0_BLOCK_ID_MASK)

#define NETC_PRIV_IEICR0_SM_ID_MASK              (0x3F0000U)
#define NETC_PRIV_IEICR0_SM_ID_SHIFT             (16U)
#define NETC_PRIV_IEICR0_SM_ID_WIDTH             (6U)
#define NETC_PRIV_IEICR0_SM_ID(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_IEICR0_SM_ID_SHIFT)) & NETC_PRIV_IEICR0_SM_ID_MASK)

#define NETC_PRIV_IEICR0_ENGINE_ID_MASK          (0x1000000U)
#define NETC_PRIV_IEICR0_ENGINE_ID_SHIFT         (24U)
#define NETC_PRIV_IEICR0_ENGINE_ID_WIDTH         (1U)
#define NETC_PRIV_IEICR0_ENGINE_ID(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_IEICR0_ENGINE_ID_SHIFT)) & NETC_PRIV_IEICR0_ENGINE_ID_MASK)

#define NETC_PRIV_IEICR0_ARM_MASK                (0x80000000U)
#define NETC_PRIV_IEICR0_ARM_SHIFT               (31U)
#define NETC_PRIV_IEICR0_ARM_WIDTH               (1U)
#define NETC_PRIV_IEICR0_ARM(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_IEICR0_ARM_SHIFT)) & NETC_PRIV_IEICR0_ARM_MASK)
/*! @} */

/*! @name IEICR1 - Integrity Error Injection Config Register 1 */
/*! @{ */

#define NETC_PRIV_IEICR1_ENGINE_EN0_MASK         (0x1U)
#define NETC_PRIV_IEICR1_ENGINE_EN0_SHIFT        (0U)
#define NETC_PRIV_IEICR1_ENGINE_EN0_WIDTH        (1U)
#define NETC_PRIV_IEICR1_ENGINE_EN0(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_IEICR1_ENGINE_EN0_SHIFT)) & NETC_PRIV_IEICR1_ENGINE_EN0_MASK)

#define NETC_PRIV_IEICR1_ENGINE_EN1_MASK         (0x2U)
#define NETC_PRIV_IEICR1_ENGINE_EN1_SHIFT        (1U)
#define NETC_PRIV_IEICR1_ENGINE_EN1_WIDTH        (1U)
#define NETC_PRIV_IEICR1_ENGINE_EN1(x)           (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_IEICR1_ENGINE_EN1_SHIFT)) & NETC_PRIV_IEICR1_ENGINE_EN1_MASK)
/*! @} */

/*! @name MEICR - Memory Error Injection Config Register */
/*! @{ */

#define NETC_PRIV_MEICR_LINK_ID_MASK             (0x1FU)
#define NETC_PRIV_MEICR_LINK_ID_SHIFT            (0U)
#define NETC_PRIV_MEICR_LINK_ID_WIDTH            (5U)
#define NETC_PRIV_MEICR_LINK_ID(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_MEICR_LINK_ID_SHIFT)) & NETC_PRIV_MEICR_LINK_ID_MASK)

#define NETC_PRIV_MEICR_MEM_ID_MASK              (0x1F00U)
#define NETC_PRIV_MEICR_MEM_ID_SHIFT             (8U)
#define NETC_PRIV_MEICR_MEM_ID_WIDTH             (5U)
#define NETC_PRIV_MEICR_MEM_ID(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_MEICR_MEM_ID_SHIFT)) & NETC_PRIV_MEICR_MEM_ID_MASK)

#define NETC_PRIV_MEICR_ARM_MASK                 (0xC0000000U)
#define NETC_PRIV_MEICR_ARM_SHIFT                (30U)
#define NETC_PRIV_MEICR_ARM_WIDTH                (2U)
#define NETC_PRIV_MEICR_ARM(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_MEICR_ARM_SHIFT)) & NETC_PRIV_MEICR_ARM_MASK)
/*! @} */

/*! @name EICR - Error Injection Code Register */
/*! @{ */

#define NETC_PRIV_EICR_EN_MASK                   (0xFFU)
#define NETC_PRIV_EICR_EN_SHIFT                  (0U)
#define NETC_PRIV_EICR_EN_WIDTH                  (8U)
#define NETC_PRIV_EICR_EN(x)                     (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_EICR_EN_SHIFT)) & NETC_PRIV_EICR_EN_MASK)
/*! @} */

/*! @name CMECR - Correctable memory error configuration register */
/*! @{ */

#define NETC_PRIV_CMECR_THRESHOLD_MASK           (0xFFU)
#define NETC_PRIV_CMECR_THRESHOLD_SHIFT          (0U)
#define NETC_PRIV_CMECR_THRESHOLD_WIDTH          (8U)
#define NETC_PRIV_CMECR_THRESHOLD(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_CMECR_THRESHOLD_SHIFT)) & NETC_PRIV_CMECR_THRESHOLD_MASK)
/*! @} */

/*! @name CMESR - Correctable memory error status register */
/*! @{ */

#define NETC_PRIV_CMESR_LINK_SLICE_ID_MASK       (0x1FU)
#define NETC_PRIV_CMESR_LINK_SLICE_ID_SHIFT      (0U)
#define NETC_PRIV_CMESR_LINK_SLICE_ID_WIDTH      (5U)
#define NETC_PRIV_CMESR_LINK_SLICE_ID(x)         (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_CMESR_LINK_SLICE_ID_SHIFT)) & NETC_PRIV_CMESR_LINK_SLICE_ID_MASK)

#define NETC_PRIV_CMESR_MEM_ID_MASK              (0x1F00U)
#define NETC_PRIV_CMESR_MEM_ID_SHIFT             (8U)
#define NETC_PRIV_CMESR_MEM_ID_WIDTH             (5U)
#define NETC_PRIV_CMESR_MEM_ID(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_CMESR_MEM_ID_SHIFT)) & NETC_PRIV_CMESR_MEM_ID_MASK)

#define NETC_PRIV_CMESR_LE_MASK                  (0x20000000U)
#define NETC_PRIV_CMESR_LE_SHIFT                 (29U)
#define NETC_PRIV_CMESR_LE_WIDTH                 (1U)
#define NETC_PRIV_CMESR_LE(x)                    (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_CMESR_LE_SHIFT)) & NETC_PRIV_CMESR_LE_MASK)

#define NETC_PRIV_CMESR_SBEE_MASK                (0x80000000U)
#define NETC_PRIV_CMESR_SBEE_SHIFT               (31U)
#define NETC_PRIV_CMESR_SBEE_WIDTH               (1U)
#define NETC_PRIV_CMESR_SBEE(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_CMESR_SBEE_SHIFT)) & NETC_PRIV_CMESR_SBEE_MASK)
/*! @} */

/*! @name CMECTR - Correctable memory error count register */
/*! @{ */

#define NETC_PRIV_CMECTR_COUNT_MASK              (0xFFU)
#define NETC_PRIV_CMECTR_COUNT_SHIFT             (0U)
#define NETC_PRIV_CMECTR_COUNT_WIDTH             (8U)
#define NETC_PRIV_CMECTR_COUNT(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_CMECTR_COUNT_SHIFT)) & NETC_PRIV_CMECTR_COUNT_MASK)
/*! @} */

/*! @name UNMECR - Uncorrectable non-fatal memory error configuration register */
/*! @{ */

#define NETC_PRIV_UNMECR_THRESHOLD_MASK          (0xFFU)
#define NETC_PRIV_UNMECR_THRESHOLD_SHIFT         (0U)
#define NETC_PRIV_UNMECR_THRESHOLD_WIDTH         (8U)
#define NETC_PRIV_UNMECR_THRESHOLD(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNMECR_THRESHOLD_SHIFT)) & NETC_PRIV_UNMECR_THRESHOLD_MASK)

#define NETC_PRIV_UNMECR_RD_MASK                 (0x80000000U)
#define NETC_PRIV_UNMECR_RD_SHIFT                (31U)
#define NETC_PRIV_UNMECR_RD_WIDTH                (1U)
#define NETC_PRIV_UNMECR_RD(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNMECR_RD_SHIFT)) & NETC_PRIV_UNMECR_RD_MASK)
/*! @} */

/*! @name UNMESR0 - Uncorrectable non-fatal memory error status register 0 */
/*! @{ */

#define NETC_PRIV_UNMESR0_LINK_SLICE_ID_MASK     (0x1FU)
#define NETC_PRIV_UNMESR0_LINK_SLICE_ID_SHIFT    (0U)
#define NETC_PRIV_UNMESR0_LINK_SLICE_ID_WIDTH    (5U)
#define NETC_PRIV_UNMESR0_LINK_SLICE_ID(x)       (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNMESR0_LINK_SLICE_ID_SHIFT)) & NETC_PRIV_UNMESR0_LINK_SLICE_ID_MASK)

#define NETC_PRIV_UNMESR0_MEM_ID_MASK            (0x1F00U)
#define NETC_PRIV_UNMESR0_MEM_ID_SHIFT           (8U)
#define NETC_PRIV_UNMESR0_MEM_ID_WIDTH           (5U)
#define NETC_PRIV_UNMESR0_MEM_ID(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNMESR0_MEM_ID_SHIFT)) & NETC_PRIV_UNMESR0_MEM_ID_MASK)

#define NETC_PRIV_UNMESR0_SYNDROME_MASK          (0x7FF0000U)
#define NETC_PRIV_UNMESR0_SYNDROME_SHIFT         (16U)
#define NETC_PRIV_UNMESR0_SYNDROME_WIDTH         (11U)
#define NETC_PRIV_UNMESR0_SYNDROME(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNMESR0_SYNDROME_SHIFT)) & NETC_PRIV_UNMESR0_SYNDROME_MASK)

#define NETC_PRIV_UNMESR0_LE_MASK                (0x20000000U)
#define NETC_PRIV_UNMESR0_LE_SHIFT               (29U)
#define NETC_PRIV_UNMESR0_LE_WIDTH               (1U)
#define NETC_PRIV_UNMESR0_LE(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNMESR0_LE_SHIFT)) & NETC_PRIV_UNMESR0_LE_MASK)

#define NETC_PRIV_UNMESR0_MBEE_MASK              (0x80000000U)
#define NETC_PRIV_UNMESR0_MBEE_SHIFT             (31U)
#define NETC_PRIV_UNMESR0_MBEE_WIDTH             (1U)
#define NETC_PRIV_UNMESR0_MBEE(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNMESR0_MBEE_SHIFT)) & NETC_PRIV_UNMESR0_MBEE_MASK)
/*! @} */

/*! @name UNMESR1 - Uncorrectable non-fatal memory error status register 1 */
/*! @{ */

