zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_PRIV.h
#define NETC_PRIV_UNMESR1_ADDR_MASK              (0xFFFFFFFFU)
#define NETC_PRIV_UNMESR1_ADDR_SHIFT             (0U)
#define NETC_PRIV_UNMESR1_ADDR_WIDTH             (32U)
#define NETC_PRIV_UNMESR1_ADDR(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNMESR1_ADDR_SHIFT)) & NETC_PRIV_UNMESR1_ADDR_MASK)
/*! @} */

/*! @name UNMECTR - Uncorrectable non-fatal memory error count register */
/*! @{ */

#define NETC_PRIV_UNMECTR_COUNT_MASK             (0xFFU)
#define NETC_PRIV_UNMECTR_COUNT_SHIFT            (0U)
#define NETC_PRIV_UNMECTR_COUNT_WIDTH            (8U)
#define NETC_PRIV_UNMECTR_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNMECTR_COUNT_SHIFT)) & NETC_PRIV_UNMECTR_COUNT_MASK)
/*! @} */

/*! @name UFMECR - Uncorrectable fatal memory error configuration register */
/*! @{ */

#define NETC_PRIV_UFMECR_RD_MASK                 (0x80000000U)
#define NETC_PRIV_UFMECR_RD_SHIFT                (31U)
#define NETC_PRIV_UFMECR_RD_WIDTH                (1U)
#define NETC_PRIV_UFMECR_RD(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFMECR_RD_SHIFT)) & NETC_PRIV_UFMECR_RD_MASK)
/*! @} */

/*! @name UFMESR0 - Uncorrectable fatal memory error status register 0 */
/*! @{ */

#define NETC_PRIV_UFMESR0_LINK_SLICE_ID_MASK     (0x1FU)
#define NETC_PRIV_UFMESR0_LINK_SLICE_ID_SHIFT    (0U)
#define NETC_PRIV_UFMESR0_LINK_SLICE_ID_WIDTH    (5U)
#define NETC_PRIV_UFMESR0_LINK_SLICE_ID(x)       (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFMESR0_LINK_SLICE_ID_SHIFT)) & NETC_PRIV_UFMESR0_LINK_SLICE_ID_MASK)

#define NETC_PRIV_UFMESR0_MEM_ID_MASK            (0x1F00U)
#define NETC_PRIV_UFMESR0_MEM_ID_SHIFT           (8U)
#define NETC_PRIV_UFMESR0_MEM_ID_WIDTH           (5U)
#define NETC_PRIV_UFMESR0_MEM_ID(x)              (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFMESR0_MEM_ID_SHIFT)) & NETC_PRIV_UFMESR0_MEM_ID_MASK)

#define NETC_PRIV_UFMESR0_EDCE_MASK              (0x8000U)
#define NETC_PRIV_UFMESR0_EDCE_SHIFT             (15U)
#define NETC_PRIV_UFMESR0_EDCE_WIDTH             (1U)
#define NETC_PRIV_UFMESR0_EDCE(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFMESR0_EDCE_SHIFT)) & NETC_PRIV_UFMESR0_EDCE_MASK)

#define NETC_PRIV_UFMESR0_SYNDROME_MASK          (0x7FF0000U)
#define NETC_PRIV_UFMESR0_SYNDROME_SHIFT         (16U)
#define NETC_PRIV_UFMESR0_SYNDROME_WIDTH         (11U)
#define NETC_PRIV_UFMESR0_SYNDROME(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFMESR0_SYNDROME_SHIFT)) & NETC_PRIV_UFMESR0_SYNDROME_MASK)

#define NETC_PRIV_UFMESR0_LE_MASK                (0x20000000U)
#define NETC_PRIV_UFMESR0_LE_SHIFT               (29U)
#define NETC_PRIV_UFMESR0_LE_WIDTH               (1U)
#define NETC_PRIV_UFMESR0_LE(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFMESR0_LE_SHIFT)) & NETC_PRIV_UFMESR0_LE_MASK)

#define NETC_PRIV_UFMESR0_M_MASK                 (0x40000000U)
#define NETC_PRIV_UFMESR0_M_SHIFT                (30U)
#define NETC_PRIV_UFMESR0_M_WIDTH                (1U)
#define NETC_PRIV_UFMESR0_M(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFMESR0_M_SHIFT)) & NETC_PRIV_UFMESR0_M_MASK)

#define NETC_PRIV_UFMESR0_MBEE_MASK              (0x80000000U)
#define NETC_PRIV_UFMESR0_MBEE_SHIFT             (31U)
#define NETC_PRIV_UFMESR0_MBEE_WIDTH             (1U)
#define NETC_PRIV_UFMESR0_MBEE(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFMESR0_MBEE_SHIFT)) & NETC_PRIV_UFMESR0_MBEE_MASK)
/*! @} */

/*! @name UFMESR1 - Uncorrectable fatal memory error status register 1 */
/*! @{ */

#define NETC_PRIV_UFMESR1_ADDR_MASK              (0xFFFFFFFFU)
#define NETC_PRIV_UFMESR1_ADDR_SHIFT             (0U)
#define NETC_PRIV_UFMESR1_ADDR_WIDTH             (32U)
#define NETC_PRIV_UFMESR1_ADDR(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFMESR1_ADDR_SHIFT)) & NETC_PRIV_UFMESR1_ADDR_MASK)
/*! @} */

/*! @name UNIECR - Uncorrectable non-fatal integrity error configuration register */
/*! @{ */

#define NETC_PRIV_UNIECR_THRESHOLD_MASK          (0xFFU)
#define NETC_PRIV_UNIECR_THRESHOLD_SHIFT         (0U)
#define NETC_PRIV_UNIECR_THRESHOLD_WIDTH         (8U)
#define NETC_PRIV_UNIECR_THRESHOLD(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNIECR_THRESHOLD_SHIFT)) & NETC_PRIV_UNIECR_THRESHOLD_MASK)

#define NETC_PRIV_UNIECR_RD_MASK                 (0x80000000U)
#define NETC_PRIV_UNIECR_RD_SHIFT                (31U)
#define NETC_PRIV_UNIECR_RD_WIDTH                (1U)
#define NETC_PRIV_UNIECR_RD(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNIECR_RD_SHIFT)) & NETC_PRIV_UNIECR_RD_MASK)
/*! @} */

/*! @name UNIESR - Uncorrectable non-fatal integrity error status register */
/*! @{ */

#define NETC_PRIV_UNIESR_LINK_SLICE_ID_MASK      (0x1FU)
#define NETC_PRIV_UNIESR_LINK_SLICE_ID_SHIFT     (0U)
#define NETC_PRIV_UNIESR_LINK_SLICE_ID_WIDTH     (5U)
#define NETC_PRIV_UNIESR_LINK_SLICE_ID(x)        (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNIESR_LINK_SLICE_ID_SHIFT)) & NETC_PRIV_UNIESR_LINK_SLICE_ID_MASK)

#define NETC_PRIV_UNIESR_BLOCK_ID_MASK           (0x1F00U)
#define NETC_PRIV_UNIESR_BLOCK_ID_SHIFT          (8U)
#define NETC_PRIV_UNIESR_BLOCK_ID_WIDTH          (5U)
#define NETC_PRIV_UNIESR_BLOCK_ID(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNIESR_BLOCK_ID_SHIFT)) & NETC_PRIV_UNIESR_BLOCK_ID_MASK)

#define NETC_PRIV_UNIESR_SM_ID_MASK              (0x3F0000U)
#define NETC_PRIV_UNIESR_SM_ID_SHIFT             (16U)
#define NETC_PRIV_UNIESR_SM_ID_WIDTH             (6U)
#define NETC_PRIV_UNIESR_SM_ID(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNIESR_SM_ID_SHIFT)) & NETC_PRIV_UNIESR_SM_ID_MASK)

#define NETC_PRIV_UNIESR_ENGINE_ID_MASK          (0x1000000U)
#define NETC_PRIV_UNIESR_ENGINE_ID_SHIFT         (24U)
#define NETC_PRIV_UNIESR_ENGINE_ID_WIDTH         (1U)
#define NETC_PRIV_UNIESR_ENGINE_ID(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNIESR_ENGINE_ID_SHIFT)) & NETC_PRIV_UNIESR_ENGINE_ID_MASK)

#define NETC_PRIV_UNIESR_LE_MASK                 (0x20000000U)
#define NETC_PRIV_UNIESR_LE_SHIFT                (29U)
#define NETC_PRIV_UNIESR_LE_WIDTH                (1U)
#define NETC_PRIV_UNIESR_LE(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNIESR_LE_SHIFT)) & NETC_PRIV_UNIESR_LE_MASK)

#define NETC_PRIV_UNIESR_INTERR_MASK             (0x80000000U)
#define NETC_PRIV_UNIESR_INTERR_SHIFT            (31U)
#define NETC_PRIV_UNIESR_INTERR_WIDTH            (1U)
#define NETC_PRIV_UNIESR_INTERR(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNIESR_INTERR_SHIFT)) & NETC_PRIV_UNIESR_INTERR_MASK)
/*! @} */

