zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_NETC_PRIV.h
/*! @name UNIECTR - Uncorrectable non-fatal integrity error count register */
/*! @{ */

#define NETC_PRIV_UNIECTR_COUNT_MASK             (0xFFU)
#define NETC_PRIV_UNIECTR_COUNT_SHIFT            (0U)
#define NETC_PRIV_UNIECTR_COUNT_WIDTH            (8U)
#define NETC_PRIV_UNIECTR_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UNIECTR_COUNT_SHIFT)) & NETC_PRIV_UNIECTR_COUNT_MASK)
/*! @} */

/*! @name UFIECR - Uncorrectable fatal integrity error configuration register */
/*! @{ */

#define NETC_PRIV_UFIECR_RD_MASK                 (0x80000000U)
#define NETC_PRIV_UFIECR_RD_SHIFT                (31U)
#define NETC_PRIV_UFIECR_RD_WIDTH                (1U)
#define NETC_PRIV_UFIECR_RD(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFIECR_RD_SHIFT)) & NETC_PRIV_UFIECR_RD_MASK)
/*! @} */

/*! @name UFIESR - Uncorrectable fatal integrity error status register */
/*! @{ */

#define NETC_PRIV_UFIESR_LINK_SLICE_ID_MASK      (0x1FU)
#define NETC_PRIV_UFIESR_LINK_SLICE_ID_SHIFT     (0U)
#define NETC_PRIV_UFIESR_LINK_SLICE_ID_WIDTH     (5U)
#define NETC_PRIV_UFIESR_LINK_SLICE_ID(x)        (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFIESR_LINK_SLICE_ID_SHIFT)) & NETC_PRIV_UFIESR_LINK_SLICE_ID_MASK)

#define NETC_PRIV_UFIESR_BLOCK_ID_MASK           (0x1F00U)
#define NETC_PRIV_UFIESR_BLOCK_ID_SHIFT          (8U)
#define NETC_PRIV_UFIESR_BLOCK_ID_WIDTH          (5U)
#define NETC_PRIV_UFIESR_BLOCK_ID(x)             (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFIESR_BLOCK_ID_SHIFT)) & NETC_PRIV_UFIESR_BLOCK_ID_MASK)

#define NETC_PRIV_UFIESR_SM_ID_MASK              (0x3F0000U)
#define NETC_PRIV_UFIESR_SM_ID_SHIFT             (16U)
#define NETC_PRIV_UFIESR_SM_ID_WIDTH             (6U)
#define NETC_PRIV_UFIESR_SM_ID(x)                (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFIESR_SM_ID_SHIFT)) & NETC_PRIV_UFIESR_SM_ID_MASK)

#define NETC_PRIV_UFIESR_ENGINE_ID_MASK          (0x1000000U)
#define NETC_PRIV_UFIESR_ENGINE_ID_SHIFT         (24U)
#define NETC_PRIV_UFIESR_ENGINE_ID_WIDTH         (1U)
#define NETC_PRIV_UFIESR_ENGINE_ID(x)            (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFIESR_ENGINE_ID_SHIFT)) & NETC_PRIV_UFIESR_ENGINE_ID_MASK)

#define NETC_PRIV_UFIESR_LE_MASK                 (0x20000000U)
#define NETC_PRIV_UFIESR_LE_SHIFT                (29U)
#define NETC_PRIV_UFIESR_LE_WIDTH                (1U)
#define NETC_PRIV_UFIESR_LE(x)                   (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFIESR_LE_SHIFT)) & NETC_PRIV_UFIESR_LE_MASK)

#define NETC_PRIV_UFIESR_M_MASK                  (0x40000000U)
#define NETC_PRIV_UFIESR_M_SHIFT                 (30U)
#define NETC_PRIV_UFIESR_M_WIDTH                 (1U)
#define NETC_PRIV_UFIESR_M(x)                    (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFIESR_M_SHIFT)) & NETC_PRIV_UFIESR_M_MASK)

#define NETC_PRIV_UFIESR_INTERR_MASK             (0x80000000U)
#define NETC_PRIV_UFIESR_INTERR_SHIFT            (31U)
#define NETC_PRIV_UFIESR_INTERR_WIDTH            (1U)
#define NETC_PRIV_UFIESR_INTERR(x)               (((uint32_t)(((uint32_t)(x)) << NETC_PRIV_UFIESR_INTERR_SHIFT)) & NETC_PRIV_UFIESR_INTERR_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group NETC_PRIV_Register_Masks */

/*!
 * @}
 */ /* end of group NETC_PRIV_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_NETC_PRIV_H_) */
